app/Controllers/OrderController.php

SELECT *
FROM `orders`
WHERE `name_user` = 'idk2'
---
    public function getUserOrders($id) {
        $model = new OrderModel();
        $orders = $model->where('name_user',$id)->get()->getResult();

SELECT *
FROM `orders`
---
    public function getOrders() {
        $model = new OrderModel();
        $orders = $model->findAll();