app/Controllers/ProductController.php

    public function getProducts()
    {

        // Add CORS headers manually
        header('Access-Control-Allow-Origin: *'); // Or specify your frontend origin: 'http://localhost:5173'
        header('Access-Control-Allow-Methods: GET, POST, OPTIONS'); // Or just GET if that's all you need
        header('Access-Control-Allow-Headers: Content-Type, Authorization'); // Add any headers your frontend sends

        $model = new ProductModel();
        $products = $model->findAll();
---
SELECT *
FROM `products`