app/Controllers/UserController.php

    public function login() {
        $model = new UserModel();

        $validationRules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($validationRules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $passwordPlain = $this->request->getPost('password');

        $user = $model->where('email_user', $email)->first();
---
SELECT *
FROM `users`
WHERE `email_user` = 'test@test.com'
 LIMIT 1

    public function sessionValidation() {
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $sessionkey = $this->request->getPost('sessionkey');

        $user = $model->where('name_user', $username)->first();
---
SELECT *
FROM `users`
WHERE `name_user` = 'undefined'
 LIMIT 1